// miniprogram/pages/content/index.js
Page({

  /**
   * 页面的初始数据
   */
  data: {
    articles: [
      {
        id: "1",
        title: "不用手揉眼睛",
        content: "当眼睛不舒服时，人们会下意识地用手揉。殊不知，手上的细菌最多。美国一项研究发现，一双未洗的手可能藏有几十万个细菌，这些细菌会引起各种眼病，尤其红眼病等。因此，千万不要用脏手揉眼睛，如果眼睛不舒服，先把手洗干净，然后闭上眼睛，轻轻按一按。有异物时，也勿用手揉眼睛，应先闭上眼睛，等到眼泪大量流出时，再睁开眼睛眨几下，多数情况下，泪水会将异物冲洗出来",
        images: [],
        tags: "",
        author: "糟糕的土拨鼠",
        publicDate:"2020-01-02 10:04",
        createDate: "2020-01-02 10:04"
      },
      {
        id: "2",
        title: "不乱用眼药水",
        content: "由于很多眼药水都是非处方药，因此不少人眼睛一不舒服就随便滴一滴，结果越用越糟。不乱用眼药水，用也得对症，眼睛红了不一定就是炎症，也有可能是过敏，如果用了消炎的眼药水，这样反而会更严重。一般只要是大包装，超过0.4毫升的眼药水都含有防腐剂。如果眼睛只是干燥、疲劳症状，我们一般用不含防腐剂的人工泪液。",
        images: [],
        tags: "",
        author: "糟糕的土拨鼠",
        publicDate:"2020-01-02 10:04",
        createDate: "2020-01-02 10:04"
      },
      {
        id: "3",
        title: "慎戴隐形眼镜",
        content: "现在普遍使用的隐形眼镜，都是使用高分子制造的，透氧效果不好，一定程度上阻碍了眼睛直接呼吸氧气，使角膜缺氧，一旦有细菌、病毒侵袭，就特别容易感染。因此，我们建议儿童佩戴角膜塑形镜，角膜塑形镜采用透气性硬质角膜接触镜材料，既可以控制近视度数快速增长，又不影响角膜的呼吸。成年人建议佩戴RGP镜，既可保证透氧性，又能对高度近视、散光患者及存在屈光参差的患者提供更优质的光学矫正效果。",
        images: [],
        tags: "",
        author: "糟糕的土拨鼠",
        publicDate:"2020-01-02 10:04",
        createDate: "2020-01-02 10:04"
      },
      {
        id: "4",
        title: "连续用眼绝不超过40分钟",
        content: "专家认为，正确的用眼习惯是保护眼睛的重中之重。一次用眼超过40分钟，就会休息10分钟，眺望一下远处，或者闭眼休息一会，这样眼睛才不容易疲劳和干燥",
        images: [],
        tags: "",
        author: "糟糕的土拨鼠",
        publicDate:"2020-01-02 10:04",
        createDate: "2020-01-02 10:04"
      },
      {
        id: "5",
        title: "外出要戴太阳镜",
        content: "眼睛很容易受到紫外线的侵袭，不但眼周皮肤会老化，对视力也有一定影响。因此，只要一出门，尤其是夏天或去紫外线比较强的海边、高山，就要戴上太阳镜。",
        images: [],
        tags: "",
        author: "糟糕的土拨鼠",
        publicDate:"2020-01-02 10:04",
        createDate: "2020-01-02 10:04"
      },
      {
        id: "6",
        title: "多吃黄绿色蔬菜",
        content: "如胡萝卜、玉米、西红柿、西兰花、猕猴桃等，含有丰富的叶黄素和玉米黄素，都能防止眼睛的功能性退变。",
        images: [],
        tags: "",
        author: "糟糕的土拨鼠",
        publicDate:"2020-01-02 10:04",
        createDate: "2020-01-02 10:04"
      }
    ]
  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad: function (options) {
  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady: function () {

  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow: function () {

  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide: function () {

  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload: function () {

  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh: function () {

  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom: function () {

  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage: function () {

  }
})